--15连接查询_内连接
'''
什么是连接
连接能干什么？当查询结果的数据来源于多张表时，需要将多张表连接成一个大的数据集进行汇总显示
mysql 支持三种类型的连接查询，
分别是
内连接查询 查询的结果为两个表符合条件匹配的数据，即两个表的交集
外连接查询，
自连接查询
'''
'''
内连接语法
select 字段 from 表1 inner join 表2 on 表1.字段1 = 表2.字段2；


注意: 1内连接:根据连接条件取出两个表的“交集”
	  2 on是连接条件 where 是连接后筛选条件
'''

-- 连接students 表 和 classes表
select * from students inner join classes;

--会出现以下情况，因为我们没有用on去指定条件，那么mysql会自己匹配students表中的字段信息究竟和哪个匹配，但是结果就是乱匹配，每条信息都和classes表中的三条信息结合，也就是共16*3=48次
'''
mysql> select * from students inner join classes;
+----+--------------+------+--------+--------+--------+----------------------+----+--------------+
| id | name         | age  | height | gender | cls_id | is_delete            | id | name         |
+----+--------------+------+--------+--------+--------+----------------------+----+--------------+
|  1 | 小明         |   18 | 180.00 | 女     |      1 | 0x00                 |  8 | Python_03期  |
|  1 | 小明         |   18 | 180.00 | 女     |      1 | 0x00                 |  2 | python_02期  |
|  1 | 小明         |   18 | 180.00 | 女     |      1 | 0x00                 |  1 | python_01期  |
|  2 | 小月月       |   18 | 180.00 | 女     |      2 | 0x01                 |  8 | Python_03期  |
|  2 | 小月月       |   18 | 180.00 | 女     |      2 | 0x01                 |  2 | python_02期  |
|  2 | 小月月       |   18 | 180.00 | 女     |      2 | 0x01                 |  1 | python_01期  |
|  3 | 彭于晏       |   29 | 185.00 | 男     |      1 | 0x00                 |  8 | Python_03期  |
|  3 | 彭于晏       |   29 | 185.00 | 男     |      1 | 0x00                 |  2 | python_02期  |
|  3 | 彭于晏       |   29 | 185.00 | 男     |      1 | 0x00                 |  1 | python_01期  |
|  4 | 刘德华       |   59 | 175.00 | 男     |      2 | 0x01                 |  8 | Python_03期  |
|  4 | 刘德华       |   59 | 175.00 | 男     |      2 | 0x01                 |  2 | python_02期  |
|  4 | 刘德华       |   59 | 175.00 | 男     |      2 | 0x01                 |  1 | python_01期  |
|  5 | 黄蓉         |   38 | 160.00 | 女     |      1 | 0x00                 |  8 | Python_03期  |
|  5 | 黄蓉         |   38 | 160.00 | 女     |      1 | 0x00                 |  2 | python_02期  |
|  5 | 黄蓉         |   38 | 160.00 | 女     |      1 | 0x00                 |  1 | python_01期  |
|  6 | 凤姐         |   28 | 150.00 | 保密   |      2 | 0x01                 |  8 | Python_03期  |
|  6 | 凤姐         |   28 | 150.00 | 保密   |      2 | 0x01                 |  2 | python_02期  |
|  6 | 凤姐         |   28 | 150.00 | 保密   |      2 | 0x01                 |  1 | python_01期  |
|  7 | 王祖贤       |   18 | 172.00 | 女     |      1 | 0x01                 |  8 | Python_03期  |
|  7 | 王祖贤       |   18 | 172.00 | 女     |      1 | 0x01                 |  2 | python_02期  |
|  7 | 王祖贤       |   18 | 172.00 | 女     |      1 | 0x01                 |  1 | python_01期  |
|  8 | 周杰伦       |   36 |   NULL | 男     |      1 | 0x00                 |  8 | Python_03期  |
|  8 | 周杰伦       |   36 |   NULL | 男     |      1 | 0x00                 |  2 | python_02期  |
|  8 | 周杰伦       |   36 |   NULL | 男     |      1 | 0x00                 |  1 | python_01期  |
|  9 | 程坤         |   27 | 181.00 | 男     |      2 | 0x00                 |  8 | Python_03期  |
|  9 | 程坤         |   27 | 181.00 | 男     |      2 | 0x00                 |  2 | python_02期  |
|  9 | 程坤         |   27 | 181.00 | 男     |      2 | 0x00                 |  1 | python_01期  |
| 10 | 刘亦菲       |   25 | 166.00 | 女     |      2 | 0x00                 |  8 | Python_03期  |
| 10 | 刘亦菲       |   25 | 166.00 | 女     |      2 | 0x00                 |  2 | python_02期  |
| 10 | 刘亦菲       |   25 | 166.00 | 女     |      2 | 0x00                 |  1 | python_01期  |
| 11 | 金星         |   33 | 162.00 | 中性   |      3 | 0x01                 |  8 | Python_03期  |
| 11 | 金星         |   33 | 162.00 | 中性   |      3 | 0x01                 |  2 | python_02期  |
| 11 | 金星         |   33 | 162.00 | 中性   |      3 | 0x01                 |  1 | python_01期  |
| 12 | 静香         |   12 | 180.00 | 女     |      4 | 0x00                 |  8 | Python_03期  |
| 12 | 静香         |   12 | 180.00 | 女     |      4 | 0x00                 |  2 | python_02期  |
| 12 | 静香         |   12 | 180.00 | 女     |      4 | 0x00                 |  1 | python_01期  |
| 13 | 郭靖         |   12 | 170.00 | 男     |      4 | 0x00                 |  8 | Python_03期  |
| 13 | 郭靖         |   12 | 170.00 | 男     |      4 | 0x00                 |  2 | python_02期  |
| 13 | 郭靖         |   12 | 170.00 | 男     |      4 | 0x00                 |  1 | python_01期  |
| 14 | 周杰         |   34 | 176.00 | 女     |      5 | 0x00                 |  8 | Python_03期  |
| 14 | 周杰         |   34 | 176.00 | 女     |      5 | 0x00                 |  2 | python_02期  |
| 14 | 周杰         |   34 | 176.00 | 女     |      5 | 0x00                 |  1 | python_01期  |
| 15 | 凌小小       |   28 | 180.00 | 女     |      1 | 0x00                 |  8 | Python_03期  |
| 15 | 凌小小       |   28 | 180.00 | 女     |      1 | 0x00                 |  2 | python_02期  |
| 15 | 凌小小       |   28 | 180.00 | 女     |      1 | 0x00                 |  1 | python_01期  |
| 16 | 司马二狗     |   28 | 120.00 | 男     |      1 | 0x00                 |  8 | Python_03期  |
| 16 | 司马二狗     |   28 | 120.00 | 男     |      1 | 0x00                 |  2 | python_02期  |
| 16 | 司马二狗     |   28 | 120.00 | 男     |      1 | 0x00                 |  1 | python_01期  |
+----+--------------+------+--------+--------+--------+----------------------+----+--------------+
48 rows in set (0.00 sec)
'''

--查询 有能够对应班级的学生以及班级信息
select * from students inner join classes on students.cls_id = classes.id;
'''
mysql> select * from students inner join classes on students.cls_id = classes.id;
+----+--------------+------+--------+--------+--------+----------------------+----+--------------+
| id | name         | age  | height | gender | cls_id | is_delete            | id | name         |
+----+--------------+------+--------+--------+--------+----------------------+----+--------------+
|  1 | 小明         |   18 | 180.00 | 女     |      1 | 0x00                 |  1 | python_01期  |
|  2 | 小月月       |   18 | 180.00 | 女     |      2 | 0x01                 |  2 | python_02期  |
|  3 | 彭于晏       |   29 | 185.00 | 男     |      1 | 0x00                 |  1 | python_01期  |
|  4 | 刘德华       |   59 | 175.00 | 男     |      2 | 0x01                 |  2 | python_02期  |
|  5 | 黄蓉         |   38 | 160.00 | 女     |      1 | 0x00                 |  1 | python_01期  |
|  6 | 凤姐         |   28 | 150.00 | 保密   |      2 | 0x01                 |  2 | python_02期  |
|  7 | 王祖贤       |   18 | 172.00 | 女     |      1 | 0x01                 |  1 | python_01期  |
|  8 | 周杰伦       |   36 |   NULL | 男     |      1 | 0x00                 |  1 | python_01期  |
|  9 | 程坤         |   27 | 181.00 | 男     |      2 | 0x00                 |  2 | python_02期  |
| 10 | 刘亦菲       |   25 | 166.00 | 女     |      2 | 0x00                 |  2 | python_02期  |
| 15 | 凌小小       |   28 | 180.00 | 女     |      1 | 0x00                 |  1 | python_01期  |
| 16 | 司马二狗     |   28 | 120.00 | 男     |      1 | 0x00                 |  1 | python_01期  |
+----+--------------+------+--------+--------+--------+----------------------+----+--------------+
12 rows in set (0.00 sec)
'''

-- 显示名字，班级
select students.name,classes.name from students inner join classes on students.cls_id=classes.id;
'''
mysql> select students.name,classes.name from students inner join classes on students.cls_id=classes.id; 
+--------------+--------------+
| name         | name         |
+--------------+--------------+
| 小明         | python_01期  |
| 小月月       | python_02期  |
| 彭于晏       | python_01期  |
| 刘德华       | python_02期  |
| 黄蓉         | python_01期  |
| 凤姐         | python_02期  |
| 王祖贤       | python_01期  |
| 周杰伦       | python_01期  |
| 程坤         | python_02期  |
| 刘亦菲       | python_02期  |
| 凌小小       | python_01期  |
| 司马二狗     | python_01期  |
+--------------+--------------+
12 rows in set (0.00 sec)
'''

--利用别名简化数据语言
-- 显示名字，班级
select s.name,c.name from students as s inner join classes as c on s.cls_id=c.id;
