--09where之范围查询
'''
目标：知道between-and 和 in的区别
范围查询氛围连续范围查询和非连续范围查询
in 表示在一个非连续的范围内
between...and...表示在一个连续的范围内,注意在匹配数据的范围是左右闭集
'''

--查询编号范围为3-8的学生
select * from students where id between 3 and 8;--包含3和8
'''
mysql> select * from students where id between 3 and 8;
+----+-----------+------+--------+--------+--------+----------------------+
| id | name      | age  | height | gender | cls_id | is_delete            |
+----+-----------+------+--------+--------+--------+----------------------+
|  3 | 彭于晏    |   29 | 185.00 | 男     |      1 | 0x00                 |
|  4 | 刘德华    |   59 | 175.00 | 男     |      2 | 0x01                 |
|  5 | 黄蓉      |   38 | 160.00 | 女     |      1 | 0x00                 |
|  6 | 凤姐      |   28 | 150.00 | 保密   |      2 | 0x01                 |
|  7 | 王祖贤    |   18 | 172.00 | 女     |      1 | 0x01                 |
|  8 | 周杰伦    |   36 |   NULL | 男     |      1 | 0x00                 |
+----+-----------+------+--------+--------+--------+----------------------+
6 rows in set (0.00 sec)

'''

--查询年龄为18、34的学生的姓名
select name,age from students where age in (18,34);
'''
mysql> select name,age from students where age in (18,34);
+-----------+------+
| name      | age  |
+-----------+------+
| 小明      |   18 |
| 小月月    |   18 |
| 王祖贤    |   18 |
| 周杰      |   34 |
+-----------+------+
4 rows in set (0.00 sec)
'''

--查询年龄不在18到34范围内的所有人
select * from students where age not between 18 and 34;
'''
+----+--------------+------+--------+--------+--------+----------------------+
| id | name         | age  | height | gender | cls_id | is_delete            |
+----+--------------+------+--------+--------+--------+----------------------+
|  3 | 彭于晏       |   29 | 185.00 | 男     |      1 | 0x00                 |
|  4 | 刘德华       |   59 | 175.00 | 男     |      2 | 0x01                 |
|  5 | 黄蓉         |   38 | 160.00 | 女     |      1 | 0x00                 |
|  6 | 凤姐         |   28 | 150.00 | 保密   |      2 | 0x01                 |
|  8 | 周杰伦       |   36 |   NULL | 男     |      1 | 0x00                 |
|  9 | 程坤         |   27 | 181.00 | 男     |      2 | 0x00                 |
| 10 | 刘亦菲       |   25 | 166.00 | 女     |      2 | 0x00                 |
| 11 | 金星         |   33 | 162.00 | 中性   |      3 | 0x01                 |
| 12 | 静香         |   12 | 180.00 | 女     |      4 | 0x00                 |
| 13 | 郭靖         |   12 | 170.00 | 男     |      4 | 0x00                 |
| 15 | 凌小小       |   28 | 180.00 | 女     |      1 | 0x00                 |
| 16 | 司马二狗     |   28 | 120.00 | 男     |      1 | 0x00                 |
+----+--------------+------+--------+--------+--------+----------------------+
12 rows in set (0.01 sec)
'''