--06where之比较运算查询

-- 使用where子句对表中的数据进行筛选，结果为true的记录会出现在结果集中
'''
where 后支持多种运算符
比较运算符
逻辑运算符
模糊查询
范围查询
空判断
'''


'''
常见的比较运算符
> < >= <= != 注意，在sql中不等于还有另外一种写法，<> 也表示不等于
'''
-- select 字段名 from 表名 where 条件语句;
select s.name,s.age from students as s where age>40;
'''
mysql> select s.name,s.age from students as s where age>40;
+-----------+------+
| name      | age  |
+-----------+------+
| 刘德华    |   59 |
+-----------+------+
1 row in set (0.00 sec)
'''
select * from students where age <> 18;
'''
mysql> select * from students where age <> 18;
+----+--------------+------+--------+--------+--------+----------------------+
| id | name         | age  | height | gender | cls_id | is_delete            |
+----+--------------+------+--------+--------+--------+----------------------+
|  3 | 彭于晏       |   29 | 185.00 | 男     |      1 | 0x00                 |
|  4 | 刘德华       |   59 | 175.00 | 男     |      2 | 0x01                 |
|  5 | 黄蓉         |   38 | 160.00 | 女     |      1 | 0x00                 |
|  6 | 凤姐         |   28 | 150.00 | 保密   |      2 | 0x01                 |
|  8 | 周杰伦       |   36 |   NULL | 男     |      1 | 0x00                 |
|  9 | 程坤         |   27 | 181.00 | 男     |      2 | 0x00                 |
| 10 | 刘亦菲       |   25 | 166.00 | 女     |      2 | 0x00                 |
| 11 | 金星         |   33 | 162.00 | 中性   |      3 | 0x01                 |
| 12 | 静香         |   12 | 180.00 | 女     |      4 | 0x00                 |
| 13 | 郭靖         |   12 | 170.00 | 男     |      4 | 0x00                 |
| 14 | 周杰         |   34 | 176.00 | 女     |      5 | 0x00                 |
| 15 | 凌小小       |   28 | 180.00 | 女     |      1 | 0x00                 |
| 16 | 司马二狗     |   28 | 120.00 | 男     |      1 | 0x00                 |
+----+--------------+------+--------+--------+--------+----------------------+
13 rows in set (0.00 sec)'''
