--08where之模糊查询

'''
模糊查询关键字:like
like后跟
% 表示任意多个任意字符
_表示一个任意字符
'''

-- 查询姓名中以刘字开头的名字
select * from students where name like "刘%"；
'''
mysql> select * from students where name like "刘%";
+----+-----------+------+--------+--------+--------+----------------------+
| id | name      | age  | height | gender | cls_id | is_delete            |
+----+-----------+------+--------+--------+--------+----------------------+
|  4 | 刘德华    |   59 | 175.00 | 男     |      2 | 0x01                 |
| 10 | 刘亦菲    |   25 | 166.00 | 女     |      2 | 0x00                 |
+----+-----------+------+--------+--------+--------+----------------------+
2 rows in set (0.00 sec)
'''

-- 查询姓名中有"小"的所有名字
select s.name from students as s where name like "%小%";
'''
mysql> select s.name from students as s where name like "%小%"; 
+-----------+
| name      |
+-----------+
| 小明      |
| 小月月    |
| 凌小小    |
+-----------+
3 rows in set (0.00 sec)

'''

-- 查询双字姓名用双下划线
select * fom students where name like '__'; 
'''
mysql> select * from students where name like '__';
+----+--------+------+--------+--------+--------+----------------------+
| id | name   | age  | height | gender | cls_id | is_delete            |
+----+--------+------+--------+--------+--------+----------------------+
|  1 | 小明   |   18 | 180.00 | 女     |      1 | 0x00                 |
|  5 | 黄蓉   |   38 | 160.00 | 女     |      1 | 0x00                 |
|  6 | 凤姐   |   28 | 150.00 | 保密   |      2 | 0x01                 |
|  9 | 程坤   |   27 | 181.00 | 男     |      2 | 0x00                 |
| 11 | 金星   |   33 | 162.00 | 中性   |      3 | 0x01                 |
| 12 | 静香   |   12 | 180.00 | 女     |      4 | 0x00                 |
| 13 | 郭靖   |   12 | 170.00 | 男     |      4 | 0x00                 |
| 14 | 周杰   |   34 | 176.00 | 女     |      5 | 0x00                 |
+----+--------+------+--------+--------+--------+----------------------+
'''

--查询至少有两个字的名字
select * from students where name like '__%';
'''
mysql> select * from students where name like '__%';
+----+--------------+------+--------+--------+--------+----------------------+
| id | name         | age  | height | gender | cls_id | is_delete            |
+----+--------------+------+--------+--------+--------+----------------------+
|  1 | 小明         |   18 | 180.00 | 女     |      1 | 0x00                 |
|  2 | 小月月       |   18 | 180.00 | 女     |      2 | 0x01                 |
|  3 | 彭于晏       |   29 | 185.00 | 男     |      1 | 0x00                 |
|  4 | 刘德华       |   59 | 175.00 | 男     |      2 | 0x01                 |
|  5 | 黄蓉         |   38 | 160.00 | 女     |      1 | 0x00                 |
|  6 | 凤姐         |   28 | 150.00 | 保密   |      2 | 0x01                 |
|  7 | 王祖贤       |   18 | 172.00 | 女     |      1 | 0x01                 |
|  8 | 周杰伦       |   36 |   NULL | 男     |      1 | 0x00                 |
|  9 | 程坤         |   27 | 181.00 | 男     |      2 | 0x00                 |
| 10 | 刘亦菲       |   25 | 166.00 | 女     |      2 | 0x00                 |
| 11 | 金星         |   33 | 162.00 | 中性   |      3 | 0x01                 |
| 12 | 静香         |   12 | 180.00 | 女     |      4 | 0x00                 |
| 13 | 郭靖         |   12 | 170.00 | 男     |      4 | 0x00                 |
| 14 | 周杰         |   34 | 176.00 | 女     |      5 | 0x00                 |
| 15 | 凌小小       |   28 | 180.00 | 女     |      1 | 0x00                 |
| 16 | 司马二狗     |   28 | 120.00 | 男     |      1 | 0x00                 |
+----+--------------+------+--------+--------+--------+----------------------+
16 rows in set (0.00 sec)

'''